# XYZ Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ Class
Members See Also
---
Object representing coordinates in 3-dimensional space.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class XYZ
```

Visual Basic
---
```text
Public Class XYZ
```

Visual C++
---
```text
public ref class XYZ
```

# Remarks
Usually this means a point or a vector in 3-dimensional space, depending on the actual use.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..XYZ
# See Also
XYZ Members
Autodesk.Revit.DB Namespace